// 在网上查到到的将xlsx数据转换成json数据。但是并没有达到我想要的效果，便舍弃了
const newarry = [];
let arry = [];
let wb;//读取完成的数据
let aa = [];
const text = [];
const rABS = false; //是否将文件读取为二进制字符串
function importExcel(obj) {//导入
    if (!obj.files) {
        return;
    }
    const IMPORTFILE_MAXSIZE = 1 * 2048;
    const suffix = obj.files[0].name.split(".")[1];
    if (suffix != 'xls' && suffix != 'xlsx') {
        alert('导入的文件格式不正确!');
        return
    }
    if (obj.files[0].size / 1024 > IMPORTFILE_MAXSIZE) {
        alert('导入的表格文件不能大于2M');
        return
    }
    var f = obj.files[0];
    var reader = new FileReader();
    reader.onload = function (e) {
        var data = e.target.result;
        if (rABS) {
            wb = XLSX.read(btoa(fixdata(data)), {//手动转化
                type: 'base64'
            });
        } else {
            wb = XLSX.read(data, {
                type: 'binary'
            });
        }
        //wb.SheetNames[0]是获取Sheets中第一个Sheet的名字
        //wb.Sheets[Sheet名]获取第一个Sheet的数据
        aa = JSON.stringify(XLSX.utils.sheet_to_json(wb.Sheets[wb.SheetNames[0]]));
    //这里有一个重要的json转成json字符串的方法，我们在获取数据的时候是用的是数组，这里获取到的是json数组，我们要转换成自己的数组然后进行引用***
        arry = JSON.parse(aa)
        for (var i in arry) {
            for (var j in arry[i]) {
                console.log(arry[i][j])
                Q9.push(arry[i][j])
            }
        }
        // console.log(Q9)
        var u = eval('(' + aa + ')');
        // document.getElementById("output").innerHTML = JSON.stringify(XLSX.utils.sheet_to_json(wb.Sheets[wb.SheetNames[0]]));
        document.getElementById('output').innerHTML += Q9;
        for (var i = 0; i < u.length; i++) {
            text.push(u[i].address);
        }
    };
    if (rABS) {
        reader.readAsArrayBuffer(f);
    } else {
        reader.readAsBinaryString(f);
        // reader.readAsText(f, "UTF-8")
    }
}
var a =[
    {
        "序号": 1,
        "专业": "计算机科学与技术",
        "核心课程名称": "高级语言程序设计",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "集合论与图论",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "近世代数",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数理逻辑",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "形式语言与自动机",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "电子技术基础",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数字逻辑设计",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机组成原理",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "软件工程",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据库系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机网络",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "编译原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机体系结构",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算概论",
        "课时": "16",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "程序设计基础",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "集合论与数理逻辑",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "图论与组合数学",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "代数结构与初等数论",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据结构",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机组成原理",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数字逻辑与数字电路",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机网络",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "编译原理",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据库原理",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "算法设计与分析",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "人工智能",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机图形学",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "高级语言程序设计",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "电路与电子技术",
        "课时": "96",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "集合论与图论",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "代数与逻辑",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数字逻辑",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机组成原理",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "操作系统原理",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "数据库原理",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "编译原理",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "软件工程",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "计算机科学与技术",
        "核心课程名称": "计算机网络",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 2,
        "专业": "软件工程",
        "核心课程名称": "程序设计基础",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "面向对象程序设计",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程导论",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "离散结构",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "工程经济学",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "团队激励与沟通",
        "课时": "24",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程职业实践",
        "课时": "16",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "计算机系统基础",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据库概论",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "网络及其计算",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "人机交互的软件工程方法",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程综合实践",
        "课时": "96",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件构造",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件设计与体系结构",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件质量保证与测试",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件需求分析",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件项目管理",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "程序设计基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "面向对象程序设计",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程导论",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "离散结构",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "工程经济学",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "团队激励与沟通",
        "课时": "24",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程职业实践",
        "课时": "16",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "计算机系统基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据库概论",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "网络及其计算",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "人机交互的软件工程方法",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程综合实践",
        "课时": "96",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "大型软件系统设计与体系结构",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件测试",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件详细设计",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程的形式化方法",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件过程与管理",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算I",
        "课时": 64,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算U",
        "课时": 64,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算HI",
        "课时": 64,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "离散结构",
        "课时": "72",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "工程经济学",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "团队激励与沟通",
        "课时": "24",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程职业实践",
        "课时": "16",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "计算机系统基础",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据库概论",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "网络及其计算",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "人机交互的软件工程方法",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程综合实践",
        "课时": "96",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件构造",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件设计与体系结构",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件质量保证与测试",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件需求分析",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件项目管理",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算I",
        "课时": 64,
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算U",
        "课时": 64,
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程与计算HI",
        "课时": 64,
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "离散结构",
        "课时": "72",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据结构与算法",
        "课时": "64",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "工程经济学",
        "课时": "32",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "团队激励与沟通",
        "课时": "24",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程职业实践",
        "课时": "16",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "计算机系统基础",
        "课时": "64",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "操作系统",
        "课时": "64",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "数据库概论",
        "课时": "64",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "网络及其计算",
        "课时": "64",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "人机交互的软件工程方法",
        "课时": "48",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程综合实践",
        "课时": "96",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "大型软件系统设计与体系结构",
        "课时": "48",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件测试",
        "课时": "48",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件详细设计",
        "课时": "48",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件工程的形式化方法",
        "课时": "40",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "专业": "软件工程",
        "核心课程名称": "软件过程与管理",
        "课时": "40",
        "备注1": "示例4",
        "本/专科": "本科"
    },
    {
        "序号": 3,
        "专业": "网络工程",
        "核心课程名称": "离散数学",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "计算机原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "计算机程序设计",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "数据结构",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "操作系统",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "计算机网络",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "数据通信",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "互联网协议分析与设计",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络应用开发与系统集成",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "路由与交换技术",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络安全",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络管理",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "移动通信与无线网络",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络测试与评价",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "离散数学",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "电路与信号分析",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "电子技术基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "程序设计",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "算法与数据结构",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "计算机组成原理",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "数据库原理与应用",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "操作系统",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "数字通信原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "计算机网络原理",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络工程设计",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "网络工程",
        "核心课程名称": "网络攻击与防护",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "序号": 4,
        "专业": "信息安全",
        "核心课程名称": "信息安全导论",
        "课时": "16",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "信息安全数学基础",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "模数电路与逻辑",
        "课时": "90",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "程序设计",
        "课时": "54",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "数据结构与算法",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "计算机组成与系统结构",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "EDA技术及应用",
        "课时": 36,
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "操作系统原理及安全",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "编译原理",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "信号与系统",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "通信原理",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "密码学",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "计算机网络",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "网络与通信安全",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "软件安全",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "逆向工程",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "可靠性技术",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "嵌入式系统安全",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "数据库原理及安全",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "取证技术",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "信息安全",
        "核心课程名称": "信息内容安全",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "序号": 5,
        "专业": "物联网工程",
        "核心课程名称": "离散数学",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "程序设计",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "数据结构",
        "课时": "72",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "计算机组成",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "计算机网络",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "操作系统",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "数据库系统",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网通信技术",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "RFID原理及应用",
        "课时": 56,
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "传感器原理及应用",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网中间件设计",
        "课时": "40",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "嵌入式系统与设计",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网控制原理与技术",
        "课时": "56",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "离散数学",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "程序设计",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "数据结构",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "计算机组成",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "计算机网络",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "操作系统",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "数据库系统",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网通信技术",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "RFID原理及应用",
        "课时": 40,
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "传感器原理及应用",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网控制",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网信息安全技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "物联网工程",
        "核心课程名称": "物联网工程设计与实践",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "序号": 6,
        "专业": "电子信息工程",
        "核心课程名称": "高级语言程序设计（C语言）",
        "课时": 48,
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "电路分析基础",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "电磁场与电磁波",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "高频电子线路",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "通信原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字信号处理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "信息论基础",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "微机原理与接口技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "算法与数据结构",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "高级语言程序设计（C语言）",
        "课时": 48,
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "信号与系统",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "工程电磁场",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "高频电子线路",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "通信原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字信号处理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "微机原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数据结构",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "高级语言程序设计C语言",
        "课时": 48,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "信号与系统",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "工程电磁场",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "通信电路基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "通信技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数字信号处理技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "微机原理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子信息工程",
        "核心课程名称": "数据结构",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 7,
        "专业": "电子科学与技术",
        "核心课程名称": "模拟电路基础课组",
        "课时": "96",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "数字电路基础课组",
        "课时": "96",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "计算机基础课组",
        "课时": "96",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "量子与统计",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "固体物理基础",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电动力学",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "激光原理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "物理光学",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "固态电子与光电子",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电路分析基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电磁场与电磁波",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "量子力学",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "固体物理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "半导体物理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "物理光学与应用光学",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电子材料",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "固态电子器件",
        "课时": "80",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "光电子技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "激光原理与技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电介质物理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电子元器件",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "量子物理",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "电磁场理论",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "激光原理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "固体电子导论",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "物理光学",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "光电子学",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电子科学与技术",
        "核心课程名称": "半导体器件物理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 8,
        "专业": "通信工程",
        "核心课程名称": "电路分析基础",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "模拟电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信电子电路",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "C++高级语言程序设计",
        "课时": 48,
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数据结构",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "微处理器与接口技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "随机信号分析",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字信号处理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "电磁场与电磁波",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信网理论基础",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "现代通信技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "电路分析基础",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "模拟电子技术",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "高频电子线路",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "计算机软件技术基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "计算机通信与网络",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "微型计算机原理及接口技术",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "信号与系统",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字信号处理",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信原理",
        "课时": "72",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "电磁场与电磁波",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信网",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信概论",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "移动通信",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "光纤通信",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信系统集成电路设计",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "电路分析基础",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信电子电路",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "高级语言程序设计",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "面向对象程序设计及C++",
        "课时": 32,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数据结构",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "微处理器与接口技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "数字信号处理",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信原理",
        "课时": "80",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "电磁场与传输理论",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "通信网基础",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "无线通信原理",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "通信工程",
        "核心课程名称": "光纤通信与数字传输",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 9,
        "专业": "光电信息科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "电磁场理论",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "工程光学及实验",
        "课时": "136",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电检测技术及系统",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光纤技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电图像处理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电信息综合实验",
        "课时": "4周",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电信息物理基础",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "通信原理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "激光原理",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "信息光学",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学系统CAD",
        "课时": 48,
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电传感器应用技术",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "量子光学基础",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "电磁场理论",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "工程光学及光学基础实验",
        "课时": "184",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "激光技术及应用",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学测量",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电信息导论",
        "课时": "英文授课，40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电检测技术",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电系统设计",
        "课时": "3周",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "傅里叶光学",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学零件工艺学",
        "课时": "4周",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "实用图像处理方法及软件",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "视频技术基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "微机接口技术",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "微机接口技术实验",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "误差理论与数据处理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "薄膜光学",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光度与色度学",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光纤技术与应用",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "像质评价技术",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学CAD课程设计",
        "课时": "3周",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "传感器原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光纤通信理论基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "信息物理基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "现代成像技术",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "电磁场理论",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "仪器零件设计",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "互换性与测量技术基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "误差理论与仪器精度",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "仪器制造工艺学",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "工程光学及实验",
        "课时": "144",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电检测技术",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "数字图像处理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学测量",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "激光原理及应用",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "仪器光学概论",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学设计及CAD",
        "课时": 48,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学仪器总体设计概论",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学零件加工",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "薄膜光学与技术",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "微纳制造技术",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光通信技术基础",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光电子技术及器件",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "光学信息处理技术",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "干涉测试技术",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "光电信息科学与工程",
        "核心课程名称": "傅里叶光学",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 10,
        "专业": "机械设计制造及其自动化",
        "核心课程名称": "机械设计原理与方法",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "机械设计制造及其自动化",
        "核心课程名称": "机械制造工程原理与技术",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "机械设计制造及其自动化",
        "核心课程名称": "机械系统中的传动与控制",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "机械设计制造及其自动化",
        "核心课程名称": "计算机应用技术",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "序号": 11,
        "专业": "国际经济与贸易",
        "核心课程名称": "国际经济与贸易",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "微观经济学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "宏观经济学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "统计学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "财政学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "金融学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "计量经济学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际经济学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "专业基础课",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际贸易学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际贸易实务",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际结算",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "跨国公司经营与管理",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "世界经济",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际政治经济学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "中国对外贸易",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "经济法",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际商法",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "市场营销",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "消费经济学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "产业经济学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "贸易经济学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "物流学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "服务贸易",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "期货市场学",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "电子商务",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "国际商务",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "国际经济与贸易",
        "核心课程名称": "商务谈判",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "序号": 12,
        "专业": "网络与新媒体",
        "核心课程名称": "新闻学概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "广播电视概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "广告学概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "传播学概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "网络与新媒体概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "出版与数字出版概论",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新闻传播伦理与法规",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "马克思主义新闻思想(或马克思主义新闻论著选读)",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "数字媒体技术",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新闻传播学研究方法",
        "课时": "",
        "备注1": "专业基础类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "网页设计与制作",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "数字多媒体作品创作",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "非线性编辑",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "融合新闻学",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新媒体数据分析与应用",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新媒体产品设计与项目管理",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "电子商务基础与应用",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "网络舆情监测与研判",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "网页设计与制作",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "数字多媒体作品创作",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "非线性编辑",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "融合新闻作品创作",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新媒体数据分析与应用",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "网络与新媒体",
        "核心课程名称": "新媒体产品设计与项目管理",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "序号": 13,
        "专业": "飞行器动力工程",
        "核心课程名称": "航空航天概论",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "工程认识与导论",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "计算机语言程序设计",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "工程材料学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "画法几何",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "机械制图",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "机械原理",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "机械设计",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "理论力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "材料力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "弹性力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "振动力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "电工学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "模拟电路",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "数字电路",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "自动控制原理",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "系统工程基础",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "计算机应用技术",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "信号与系统",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "流体力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "空气动力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "气体动力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "结构力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "工程热力学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "传热学",
        "课时": "",
        "备注1": "学科基础知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "飞行器动力装置原理",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "飞行器动力装置气动与结构设计",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "飞行器动力装置燃烧理论",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "飞行器动力装置控制与监控",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "专业": "飞行器动力工程",
        "核心课程名称": "飞行器动力装置原理实验与测试",
        "课时": "",
        "备注1": "专业知识",
        "本/专科": "本科"
    },
    {
        "序号": 14,
        "专业": "英语",
        "核心课程名称": "综合英语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语视听说",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语口语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语阅读",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语写作",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语语法",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语演讲",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语辩论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英汉/汉英笔译",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英汉/汉英口译",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "语言导论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "英语文学导论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "跨文化交际",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "西方文明史",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "英语",
        "核心课程名称": "学术写作与研究方法",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 15,
        "专业": "翻译",
        "核心课程名称": "综合外语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "外语听力",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "外语口语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "外语阅读",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "外语写作",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "现代汉语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "古代汉语",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "高级汉语写作",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "翻译概论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "外汉笔译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "汉外笔译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "应用翻译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "联络口译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "交替传译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "专题口译",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "中国文化概论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "所学外语国家概况",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "所学外语国家文学概论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "语言导论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "翻译",
        "核心课程名称": "跨文化交际",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 16,
        "专业": "信息与计算科学",
        "核心课程名称": "微分几何",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "复变函数",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "实变函数",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "泛函分析",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "抽象代数",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "拓扑学",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数理统计",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "随机过程",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "离散数学",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "偏微分方程",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数学建模",
        "课时": "",
        "备注1": "A组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数值分析",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "微分方程数值解",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "程序设计与算法语言",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数据结构与算法",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "信息论基础",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "编码理论",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数字信号处理",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "数据分析",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "控制论基础",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "专业": "信息与计算科学",
        "核心课程名称": "运筹学",
        "课时": "",
        "备注1": "B组",
        "本/专科": "本科"
    },
    {
        "序号": 17,
        "专业": "应用统计学",
        "核心课程名称": "数学分析",
        "课时": "",
        "备注1": "数学类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "高等代数",
        "课时": "",
        "备注1": "数学类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "概率论",
        "课时": "",
        "备注1": "数学类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t应用回归分析",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "应用多元统计分析",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "应用时间序列分析",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t抽样调查",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t统计计算与应用软件",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "统计学导论",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "数理统计",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t试验设计",
        "课时": 32,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t应用随机过程",
        "课时": 32,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "应用统计学",
        "核心课程名称": "\t统计预测和决策",
        "课时": 48,
        "备注1": "专业类必修课程",
        "本/专科": "本科"
    },
    {
        "序号": 18,
        "专业": "电子商务",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "电子商务基础-管理学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "电子商务基础-管理学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "统计学",
        "课时": "",
        "备注1": "电子商务基础-管理学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "运筹学",
        "课时": "",
        "备注1": "电子商务基础-管理学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "经济学",
        "课时": "",
        "备注1": "电子商务基础-经济学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "计量经济学",
        "课时": "",
        "备注1": "电子商务基础-经济学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "信息经济或网络经济、数字经济",
        "课时": "",
        "备注1": "电子商务基础-经济学",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网络技术",
        "课时": "",
        "备注1": "电子商务基础-信息技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "数据库管理",
        "课时": "",
        "备注1": "电子商务基础-信息技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "程序设计基础",
        "课时": "",
        "备注1": "电子商务基础-信息技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "市场营销",
        "课时": "",
        "备注1": "电子商务经济管理-网络营销",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网络营销",
        "课时": "",
        "备注1": "电子商务经济管理-网络营销",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "消费者行为学",
        "课时": "",
        "备注1": "电子商务经济管理-网络营销",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网络零售",
        "课时": "",
        "备注1": "电子商务经济管理-网络交易与贸易",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网络贸易",
        "课时": "",
        "备注1": "电子商务经济管理-网络交易与贸易",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "国际贸易",
        "课时": "",
        "备注1": "电子商务经济管理-网络交易与贸易",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务管理",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "供应链与物流管理",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务组织与运营",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "企业资源计划",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "客户关系管理",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "商务智能",
        "课时": "",
        "备注1": "电子商务经济管理-电子商务运营与管理",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "互联网金融",
        "课时": "",
        "备注1": "电子商务经济管理-网络金融与支付",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子支付",
        "课时": "",
        "备注1": "电子商务经济管理-网络金融与支付",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网页设计与制作",
        "课时": "",
        "备注1": "电子商务工程技术-应用开发技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "高级程序设计",
        "课时": "",
        "备注1": "电子商务工程技术-应用开发技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "移动开发技术",
        "课时": "",
        "备注1": "电子商务工程技术-应用开发技术",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网站建设与管理",
        "课时": "",
        "备注1": "电子商务工程技术-系统设计与实施",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "管理信息系统",
        "课时": "",
        "备注1": "电子商务工程技术-系统设计与实施",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务系统分析与设计",
        "课时": "",
        "备注1": "电子商务工程技术-系统设计与实施",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "现代物流技术",
        "课时": "",
        "备注1": "电子商务工程技术-系统设计与实施",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "数据仓库",
        "课时": "",
        "备注1": "电子商务工程技术-数据处理与分析",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "大数据分析",
        "课时": "",
        "备注1": "电子商务工程技术-数据处理与分析",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务安全",
        "课时": "",
        "备注1": "电子商务工程技术-电子商务安全",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务概论或电子商务原理",
        "课时": "",
        "备注1": "电子商务综合-电子商务概述",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务案例分析",
        "课时": "",
        "备注1": "电子商务综合-电子商务概述",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务法律与法规",
        "课时": "",
        "备注1": "电子商务综合-电子商务法律与法规",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "电子商务服务",
        "课时": "",
        "备注1": "电子商务综合-电子商务服务",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "网络创业与创业管理",
        "课时": "",
        "备注1": "电子商务综合-互联网创新与创业",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "云计算",
        "课时": "",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "社交化电子商务或社会化电子商务",
        "课时": "",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "移动电子商务",
        "课时": "",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "跨境电子商务",
        "课时": "",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "物联网",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "专业": "电子商务",
        "核心课程名称": "“互联网+”战略与实施",
        "备注1": "电子商务综合-互联网前沿专题",
        "本/专科": "本科"
    },
    {
        "序号": 19,
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息系统分析与设计*",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "数据库与数据结构*",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "计算机网络与应用*",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息资源管理*",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "商务智能与决策支持系统",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "商务分析方法与工具",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息系统开发方法与工具",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "企业资源规划系统与应用",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息组织与信息检索",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "电子商务与网络营销",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息技术IT项目管理",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "序号": 20,
        "专业": "信息管理与信息系统",
        "核心课程名称": "信息与网络安全管理",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "战略管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "财务管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "组织行为学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "人力资源管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "市场营销学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "创业学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "公司治理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "人力资源管理",
        "核心课程名称": "运营管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 21,
        "专业": "审计学",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "战略管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "财务管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "组织行为学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "人力资源管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "市场营销学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "创业学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "公司治理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "审计学",
        "核心课程名称": "运营管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 22,
        "专业": "财务管理",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "战略管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "财务管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "组织行为学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "人力资源管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "市场营销学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "创业学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "公司治理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "财务管理",
        "核心课程名称": "运营管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 23,
        "专业": "文化产业管理",
        "核心课程名称": "管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "战略管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "财务管理学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "组织行为学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "人力资源管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "市场营销学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "创业学",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "公司治理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "文化产业管理",
        "核心课程名称": "运营管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 24,
        "专业": "电气工程及其自动化",
        "核心课程名称": "基本电路理论",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "模拟电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "嵌入式系统原理与实验",
        "课时": "80",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "磁场",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "信号与系统",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "自动控制原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "通信原理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电气工程基础",
        "课时": "96",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电机学",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电机控制技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力系统继电保护",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电气与电子测量技术",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力系统暂态分析",
        "课时": "32",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "数字信号处理",
        "课时": "",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "工程电磁场",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "模拟电子技术基础",
        "课时": "56",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "数字电子技术基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电机学",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "信号分析与处理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "自动控制理论",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "微机原理与接口技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力系统分析基础",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力系统暂态分析",
        "课时": "32",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力系统继电保护原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "高电压技术",
        "课时": "40",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电路理论",
        "课时": "96",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电路原理",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "模拟电子技术基础",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "数字电子技术基础",
        "课时": "56",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "自动控制理论",
        "课时": "62",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电机与电力拖动基础",
        "课时": "62",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电力电子技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "供电工程",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电器控制与可编程控制器",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "单片机原理及应用",
        "课时": "40",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "电气工程及其自动化",
        "核心课程名称": "电气测量技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 25,
        "专业": "微电子科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "信号与系统",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体物理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "数字集成电路设计",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路工艺原理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体器件物理",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "数字集成电路原理",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "电子系统设计",
        "课时": "64",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路计算机辅助设计",
        "课时": "48",
        "备注1": "示例1",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "电磁场理论",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "信号与系统",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "固体物理学",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体物理学",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路原理与设计",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体器件物理",
        "课时": "64",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "微电子制造原理",
        "课时": "48",
        "备注1": "示例2",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "电路分析基础",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "模拟电子技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "数字电子技术",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "固体物理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体物理",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体器件物理",
        "课时": "64",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体工艺",
        "课时": "48",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路原理与设计",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路CAD",
        "课时": 32,
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "集成电路工艺设计",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体光电材料",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体光电器件原理",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "专业": "微电子科学与工程",
        "核心课程名称": "半导体光电器件工艺",
        "课时": "32",
        "备注1": "示例3",
        "本/专科": "本科"
    },
    {
        "序号": 26,
        "专业": "生物技术",
        "核心课程名称": "生命的化学基础",
        "课时": "96",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "细胞的结构、功能与重大生命活动",
        "课时": "48",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物体的结构与功能及生物多样性",
        "课时": "48",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "微生物的特征与代谢",
        "课时": "48",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物与环境",
        "课时": "16",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物的遗传",
        "课时": "48",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物技术的原理与应用",
        "课时": "128",
        "备注1": "专业核心知识",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "普通生物学",
        "备注1": "专业基础核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物化学",
        "备注1": "专业基础核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "细胞生物学",
        "备注1": "专业基础核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "遗传学",
        "备注1": "专业基础核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "微生物学",
        "备注1": "专业基础核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "基因工程",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "蛋白质与酶工程",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "细胞工程",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生物信息学",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "生物技术",
        "核心课程名称": "生化分离与分析技术",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 27,
        "专业": "休闲体育",
        "核心课程名称": "体育概论",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "运动解剖学",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "运动生理学",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "体育心理学",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "体育社会学",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "健康教育学",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "体育科学研究方法",
        "课时": "",
        "备注1": "专业类基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "休闲体育概论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "体育旅游概论",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "专业": "休闲体育",
        "核心课程名称": "体育俱乐部经营与管理",
        "课时": "",
        "备注1": "专业核心课程",
        "本/专科": "本科"
    },
    {
        "序号": 28,
        "专业": "数字媒体技术",
        "核心课程名称": "数字媒体技术数学基础模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字媒体技术",
        "核心课程名称": "数字媒体技术基础模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字媒体技术",
        "核心课程名称": "数字媒体技术开发与应用模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字媒体技术",
        "核心课程名称": "游戏开发技术模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字媒体技术",
        "核心课程名称": "数字媒体产业知识模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字媒体技术",
        "核心课程名称": "创新创业技能模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "序号": 29,
        "专业": "动画",
        "核心课程名称": "动画基本原理模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "动画故事模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "动画造型模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "动画动作设计模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "漫画插画模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "数字动画模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "游戏设计艺术模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "数字内容产业知识模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "专业": "动画",
        "核心课程名称": "创新创业技能模块",
        "课时": "",
        "备注1": "专业主干课程",
        "本/专科": "本科"
    },
    {
        "序号": 30,
        "专业": "数字出版",
        "核心课程名称": "数字出版技术",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "数字出版创意与策划",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "数字多媒体作品创作",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "数字多媒体作品赏析",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "网页设计与制作",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "网络与新媒体广告",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "出版法规",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "视觉传播",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "电子商务基础与应用",
        "课时": "",
        "备注1": "专业类课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "数字出版创意与策划",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "数字多媒体作品创作",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "专业": "数字出版",
        "核心课程名称": "网页设计与制作",
        "课时": "",
        "备注1": "专业实训课程",
        "本/专科": "本科"
    },
    {
        "序号": 31,
        "专业": "工艺美术",
        "核心课程名称": "传统及现代手工艺材料",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "工艺美术",
        "核心课程名称": "传统及现代手工艺设计",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "工艺美术",
        "核心课程名称": "传统及现代手工艺制作",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "专业": "工艺美术",
        "核心课程名称": "传统及现代手工艺研发",
        "课时": "",
        "备注1": "专业课程",
        "本/专科": "本科"
    },
    {
        "序号": 32,
        "专业": "投资学",
        "核心课程名称": "政治经济学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "微观经济学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "宏观经济学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "计量经济学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "金融学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "财政学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "统计学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "会计学",
        "课时": "",
        "备注1": "专业基础课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "证券投资学",
        "课时": "",
        "备注1": "专业必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "公司金融",
        "课时": "",
        "备注1": "专业必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "投资银行学",
        "课时": "",
        "备注1": "专业必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "项目评估与管理",
        "课时": "",
        "备注1": "专业必修课程",
        "本/专科": "本科"
    },
    {
        "专业": "投资学",
        "核心课程名称": "金融风险管理",
        "课时": "",
        "备注1": "专业必修课程",
        "本/专科": "本科"
    },
    {
        "序号": 33,
        "专业": "人工智能",
        "核心课程名称": "无",
        "课时": "",
        "本/专科": "本科"
    },
    {
        "序号": 34,
        "专业": "数据科学与大数据技术",
        "核心课程名称": "无",
        "课时": "",
        "本/专科": "本科"
    },
    {
        "序号": 35,
        "专业": "机器人工程",
        "核心课程名称": "无",
        "课时": "",
        "本/专科": "本科"
    },
    {
        "序号": 36,
        "专业": "电磁场与无线技术",
        "核心课程名称": "无",
        "课时": "",
        "备注1": "特设专业",
        "本/专科": "本科"
    },
    {
        "序号": 37,
        "专业": "集成电路设计与集成系统",
        "核心课程名称": "无",
        "课时": "",
        "备注1": "特设专业",
        "本/专科": "本科"
    },
    {
        "序号": 38,
        "专业": "智能科学与技术",
        "核心课程名称": "无",
        "课时": "",
        "备注1": "特设专业",
        "本/专科": "本科"
    },
    {
        "序号": 39,
        "专业": "电子与计算机工程",
        "核心课程名称": "无",
        "课时": "",
        "备注1": "特设专业",
        "本/专科": "本科"
    },
    {
        "序号": 40,
        "专业": "艺术与科技",
        "核心课程名称": "无",
        "课时": "",
        "本/专科": "本科"
    }
]